app/views/admin/budget.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 8 LIMIT 1
---
									<td><%= item.reason %></td>
									<td><%= Users.find(item.user_id).name %></td>