app/views/reservations/index.html.erb

SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 ORDER BY `rooms`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
									<% end %>
									<%  if ((current_user.id == item.user_id) || (not Manager.where(room_id: item.room_id, user_id: current_user.id).first.nil?)) && Time.now < item.end_at %>