app/controllers/admin_controller.rb

SELECT `users`.* FROM `users` ORDER BY created_at DESC
---
  def muzikus
  	if current_user
  		@allUsers = Users.all.order("created_at DESC")

SELECT `muzikususers`.* FROM `muzikususers` WHERE (email = 'metehantutar@sabanciuniv.edu') ORDER BY `muzikususers`.`id` ASC LIMIT 1
SELECT `budgets`.* FROM `budgets` ORDER BY created_at DESC
---
  def budget
	  if current_user
	  	if (Muzikususers.where("email = ?", current_user.sabancimail).first.ismyk == true)
		  	@newBudget = Budget.new
		  	@allBudgets = Budget.all.order("created_at DESC")