app/controllers/main_controller.rb

  def index
    if current_user
      if current_user.sabancimail
        if Muzikususers.where('email = ?', current_user.sabancimail).count > 0
---
SELECT COUNT(*) FROM `muzikususers` WHERE (email = 'ynizipli@sabanciuniv.edu')
SELECT `muzikususers`.* FROM `muzikususers` WHERE (email = 'ynizipli@sabanciuniv.edu') ORDER BY `muzikususers`.`id` ASC LIMIT 1