app/controllers/reservations_controller.rb

	def create
		@newReservation = Reservation.new(reservation_params)
		p ENV['HANGAR_ID'].to_i, ENV['DRUM_ID'].to_i
		if(@newReservation.room_id.nil? || @newReservation.start_at.nil? || @newReservation.end_at.nil?)
			render json: {type: 'warning', message: 'It seems like you forgot something, master.'}, status: :not_acceptable
			return
		elsif(@newReservation.start_at > @newReservation.end_at)
			render json:  {type: 'warning', message: 'End date must be greater than start date... Please refresh the current page and try again.'}, status: :not_acceptable
			return
		else
			if current_user && current_user.is_member
				if @newReservation.room_id == ENV['HANGAR_ID'].to_i && !current_user.is_workshop
					render json: {type: 'error', title: 'Oh snap!', text: 'You cannot reserve this room because you didn\'t take hangar workshop.'}, status: :not_acceptable
					return
				elsif @newReservation.room_id == ENV['DRUM_ID'].to_i && !current_user.is_drum
					render json: {type: 'error', title: 'Oh snap!', text: 'You cannot reserve this room because you are not taking drum lesson.'}, status: :not_acceptable
					return
				end
				@newReservation.user_id = current_user.id
				isValid = true
				#take 6 hour interval to check if its occupied before
				reservationsOnThatDay = Reservation.where(room_id: @newReservation.room_id).where('start_at BETWEEN ? AND ?', @newReservation.start_at - 2.hours, @newReservation.start_at + 2.hours)
---
SELECT SUM(`reservations`.`hour`) AS sum_id FROM `reservations` WHERE (start_date BETWEEN '2013-10-23 21:00:00' AND '2013-10-24 20:59:59') AND (user_id = 5) AND (room_id = 6)
SELECT `reservations`.* FROM `reservations` WHERE (start_date BETWEEN '2013-10-23 21:00:00' AND '2013-10-24 20:59:59') AND (room_id = 6)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1

						end
						total += (@newReservation.end_at - @newReservation.start_at)
						if total <= 60*60*2
							@newReservation.save!
---
INSERT INTO `reservations` (`created_at`, `end_date`, `hour`, `info`, `room_id`, `start_date`, `updated_at`, `user_id`) VALUES ('2013-10-22 12:32:22', '2013-10-24 22:00:00', 3, '', 6, '2013-10-24 19:00:00', '2013-10-22 12:32:22', 5)