app/controllers/scout_controller.rb

  def index
  	if current_user
  		@current = Scout.where("user_id = ?", current_user.id).first
---
SELECT `scouts`.* FROM `scouts` WHERE `scouts`.`id` = 1 LIMIT 1